app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT 1
---
  <% end %>
 <%= f.select :category_id, Category.all.collect {|p| [ p.name, p.id ] } , prompt: 'Select Category' %>