app/views/posts/index.html.erb

                <div class="col-md-2 col-sm-3 text-center">
                  <% if post.user.present? && !post.user.avatar.nil? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1

                      <p class="pull-right">
                        <% post.tag_list.each do |tag|%>
---
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN posts ON posts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Post' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT posts.id FROM "posts")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id

                        <li><%= time_ago_in_words(post.created_at) %></li>
                        <li><%= post.comments.count %> Comments</li>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]