app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asas"], ["created_at", Fri, 18 Apr 2014 20:53:26 UTC +00:00], ["post_id", 1], ["updated_at", Fri, 18 Apr 2014 20:53:26 UTC +00:00], ["user_id", 1]]
---
  def create
    @comment = Comment.new(comment_params)
    @post = Post.find(params[:post_id])
    @comment.post = @post
    @comment.user = current_user
    respond_to do |format|
      if @comment.save