app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
SELECT "posts".* FROM "posts" WHERE (category_id => '2')
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN posts ON posts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Post' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT posts.id FROM "posts")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
SELECT COUNT(*) FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN posts ON posts.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Post' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT posts.id FROM "posts")) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id
---
  def index
    if params[:tag]
       @posts = Post.tagged_with(params[:tag])
    elsif params[:category_id]
       @posts = Post.with_category(params[:category_id])
    else
      @posts = Post.all
    end
    @posts = @posts.paginate(:page => params[:page], :per_page => 2)

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "help me help you"], ["created_at", Fri, 18 Apr 2014 20:15:05 UTC +00:00], ["title", "it now or never"], ["updated_at", Fri, 18 Apr 2014 20:15:05 UTC +00:00]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "category_id" = $1, "updated_at" = $2 WHERE "posts"."id" = 1  [["category_id", 1], ["updated_at", Mon, 21 Apr 2014 22:42:45 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)